In [1]:
import pandas as pd
import numpy as np

In [11]:
arr = np.random.randint(1,55,size=(4,4))
arr

array([[50, 13, 17,  5],
       [18, 31, 28, 14],
       [ 8, 42, 36, 26],
       [18, 53, 26, 41]])

In [14]:
df1 = pd.DataFrame(data=arr,index=('A','B','C','D'),columns=('1a','2b','3c','4d'))
df1

   1a  2b  3c  4d
A  50  13  17   5
B  18  31  28  14
C   8  42  36  26
D  18  53  26  41

In [21]:
arr = [[12,123,12455,3221],[12,7654,333,5667],[123,7654,3332,245]]
df2 = pd.DataFrame(data=arr,index=('a','b','c'),columns=('1a','2b','3c','4d'))
df2

    1a    2b     3c    4d
a   12   123  12455  3221
b   12  7654    333  5667
c  123  7654   3332   245

In [30]:
diff = {'produto':['smartphone','pc','note'],'valor':[1500,3000,2500]}
df3 = pd.DataFrame(data=diff)
df3['teste'] = [1,2,3]
df3

      produto  valor  teste
0  smartphone   1500      1
1          pc   3000      2
2        note   2500      3